export const universityData = [
  {
    id: 1,
    name: "جامعة الملك سعود",
    colleges: [
      "كلية الطب",
      "كلية الهندسة",
      "كلية علوم الحاسب",
      "كلية الصيدلة",
      "كلية إدارة الأعمال",
      "كلية النشاط البدني والرياضي",
      "كلية العمارة والتخطيط",
    ],
  },
  {
    id: 2,
    name: "جامعة الملك فهد للبترول والمعادن",
    colleges: [
      "كلية الهندسة الكيميائية",
      "كلية الهندسة الكهربائية",
      "كلية الهندسة الميكانيكية",
      "كلية هندسة الحاسب",
      "كلية الهندسة المدنية",
      "كلية الهندسة الصناعية",
      "كلية علوم الحاسب",
      "كلية إدارة الأعمال",
      "كلية العلوم",
    ],
  },
  {
    id: 3,
    name: "جامعة الملك عبدالعزيز",
    colleges: [
      "كلية الطب",
      "كلية الهندسة",
      "كلية علوم الحاسب",
      "كلية الصيدلة",
      "كلية إدارة الأعمال",
      "كلية الإعلام",
      "كلية الآداب",
    ],
  },
  {
    id: 4,
    name: "جامعة الإمام محمد بن سعود",
    colleges: [
      "كلية الشريعة",
      "كلية أصول الدين",
      "كلية الطب",
      "كلية القانون",
      "كلية إدارة الأعمال",
      "كلية الهندسة",
      "كلية الإعلام",
    ],
  },
  {
    id: 5,
    name: "جامعة الملك خالد",
    colleges: [
      "كلية الطب",
      "كلية الهندسة",
      "كلية الحاسب الآلي",
      "كلية إدارة الأعمال",
      "كلية الصيدلة",
      "كلية العلوم الطبية التطبيقية",
      "كلية التربية",
    ],
  },
];

export const universities = universityData.map((uni) => uni.name);
